{
    "projects": [
        {
            "title": "GlobePlotter (collab)",
            "imgSrc": "globePlotter",
            "description": "GlobePlotter offers users a semi-curated trip planning experience. It also provides users with a checklist of activities for each trip they create, and a retrospective view of trips they have completed.",
            "deployedUrl": "http://theglobeplotter.com/",
            "repoUrl": "https://github.com/ravalash/Globe-Plotter"
        },
        {
            "title": "Weather Dashboard",
            "imgSrc": "weatherDashboard",
            "description": "Weather Dashboard allows users to search for a city and find its current and five-day forecasts. Previous searches are recorded and displayed, and the UI updates according to the time of day in the current city's timezone.",
            "deployedUrl": "https://dvorakjt.github.io/weather-dashboard/",
            "repoUrl": "https://github.com/dvorakjt/weather-dashboard"
        },
        {
            "title": "Employee Directory",
            "imgSrc": "employeeDirectory",
            "description": "Employee Directory allows the user to filter and sort through a directory of personnel based on different criteria. Information for each user is presented in a table with rows dynamically generated using React.",
            "deployedUrl": "https://salty-sierra-88203.herokuapp.com/",
            "repoUrl": "https://github.com/dvorakjt/employee-directory"
        },
        {
            "title": "Note Taker",
            "imgSrc": "noteTaker",
            "description": "Note taker allows users to save and delete notes. The notes are saved to a db.json file, and the application is deployed via an express server.",
            "deployedUrl": "https://nameless-waters-89147.herokuapp.com/",
            "repoUrl": "https://github.com/dvorakjt/note-taker"
        },
        {
            "title": "Song in the Life",
            "imgSrc": "songInTheLife",
            "description": "Song in the Life allows users to search for a song, and learn a little bit more about its context in time. Some of the information returned includes the album, the album art, the artist, and a random fact from the year of its release.",
            "deployedUrl": "https://g0nzy.github.io/song-in-the-life/",
            "repoUrl": "https://github.com/G0nZy/song-in-the-life"
        },
        {
            "title": "Team Builder",
            "imgSrc": "teamBuilder",
            "description": "Team Builder uses templates and user input to generate an html file displaying information about team personnel. This is a CLI application that takes user input and then generates html at the end of the process.",
            "deployedUrl": "",
            "repoUrl": "https://github.com/dvorakjt/teamBuilder"
        }
    ]
}